server/app/controllers/api/v0/orders_controller.rb

INSERT INTO "orders" ("coffeebean", "coffeeintensity", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["coffeebean", "normal"], ["coffeeintensity", 5.0], ["created_at", Sat, 01 Nov 2014 07:08:05 UTC +00:00], ["updated_at", Sat, 01 Nov 2014 07:08:05 UTC +00:00]]
---
  def create
    order = Order.new(order_params)
    if order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "2"]]
---
  def feedback
    order = Order.find(order_params[:id])

SELECT "orders".* FROM "orders"
---
  def index
    render json: Order.all